src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДопРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДопРасходовБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРеглБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорРазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСписания</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПродажи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.КорректировкаНалоговогоНазначенияЗапасов</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаОбособленногоУчетаЗапасов</types>
      <types>DocumentRef.ОтчетОРозничнойВыручке</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ПорчаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/АналитикаУчетаПоПартнерам/АналитикаУчетаПоПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаУчетаПоПартнерам</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/АналитикаУчетаНоменклатуры/АналитикаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаУчетаНоменклатуры</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПравилаРаспределенияНаСебестоимостьТоваров/ПравилаРаспределенияНаСебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПравилаРаспределенияНаСебестоимостьТоваров</name>
  <enumValues>
    <name>ПропорциональноКоличеству</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноВесу</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъему</name>
  </enumValues>
</mdclass:Enum>

src/CommonForms/РаспределениеРасходовНаПоступления/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	НаименованиеЕдиницыИзмеренияВеса = Строка(Константы.ЕдиницаИзмеренияВеса.Получить());
	НаименованиеЕдиницыИзмеренияОбъема = Строка(Константы.ЕдиницаИзмеренияОбъема.Получить());
	
	Если Параметры.Свойство("Валюта") Тогда
		Валюта = Параметры.Валюта;
	Иначе
		Валюта = Константы.ВалютаУправленческогоУчета.Получить();
	КонецЕсли;
	
	УстановитьЗаголовкиПолей();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаСтрок") Тогда
		ЗаполнитьРеквизитыДокумента();
	КонецЕсли;
	
	УстановитьПравилоРаспределения();
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		ЭтаФорма.Заголовок = НСтр("ru='Распределение расходов на себестоимость товаров';uk='Розподіл витрат на собівартість товарів'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьОстатокКРаспределению();
	РассчитатьИтоговыеСуммы();
	ПроверитьЗаполнениеКоэффициентов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриИзменении(Элемент)
	ПересчитатьОстатокКРаспределению();
	РассчитатьИтоговыеСуммы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантРаспределенияПриИзменении(Элемент)
	ПроверитьЗаполнениеКоэффициентов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовДокументПриИзменении(Элемент)
	Результат = ЗаполнитьИнформационныеПоля(Элементы.СписокДокументов.ТекущиеДанные.АналитикаРасходов);
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьЗначенияСвойств(Элементы.СписокДокументов.ТекущиеДанные, Результат);
		
		СтрокаТЧ = Элементы.СписокДокументов.ТекущиеДанные;
		СтрокаТЧ.Количество = Количество;
		СтрокаТЧ.Содержание = Содержание;
		СтрокаТЧ.СтавкаНДС = СтавкаНДС;
		СтрокаТЧ.Подразделение = Подразделение;
		СтрокаТЧ.СтатьяРасходов = СтатьяРасходов;
		
		ПересчитатьОстатокКРаспределению();
		РассчитатьИтоговыеСуммы();
		ПроверитьЗаполнениеКоэффициентов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Если ОсталосьРаспределить <> 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо дораспределить на документы поступления';uk='Необхідно дорозподілити на документи надходження'") + " " + ОсталосьРаспределить + " " + Валюта;
		Сообщение.Сообщить();
	Иначе
		Закрыть(ПоместитьРезультатВоВременноеХранилище());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБазуРаспределения(Команда)
	МассивДокументов = Новый СписокЗначений();
	Для Каждого ТекСтрока Из СписокДокументов Цикл
		МассивДокументов.Добавить(ТекСтрока.АналитикаРасходов);
	КонецЦикла;
	
	ОткрытьФорму("Отчет.РасшифровкаПоступленийПоНоменклатуре.Форма",
		Новый Структура("Отбор, КлючВарианта, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
			Новый Структура("МассивДокументов", МассивДокументов), 
			"ПоступленияСоСтрокамиКонтекстный", 
			Истина,
			Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНезаполненныеСтроки(Команда)
	МассивДокументов = Новый СписокЗначений();
	Для Каждого ТекСтрока Из СписокДокументов Цикл
		МассивДокументов.Добавить(ТекСтрока.АналитикаРасходов);
	КонецЦикла;
	
	ОткрытьФорму("Отчет.РасшифровкаПоступленийПоНоменклатуре.Форма",
		Новый Структура("Отбор, КлючВарианта, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
			Новый Структура("МассивДокументов", МассивДокументов), 
			"НезаполненныеВесОбъемВПоступленияхКонтекстный", 
			Истина,
			Ложь));
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(
		"ОбщаяФорма.РаспределениеРасходовНаПоступления.Команда.Распределить");
	
	Если ПравилоРаспределения = "ПоКоличеству" Тогда
		Итог = ИтогоКоличество;
		ИмяКоэффициента = "КоэффициентКоличество";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально количеству накладной';uk='Розподілена сума %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорційно кількості накладної'");
	ИначеЕсли ПравилоРаспределения = "ПоВесу" Тогда
		Итог = ИтогоВес;
		ИмяКоэффициента = "КоэффициентВес";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально весу накладной';uk='Розподілена сума %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорційно вазі накладної'");
	ИначеЕсли ПравилоРаспределения = "ПоОбъему" Тогда
		Итог = ИтогоОбъем;
		ИмяКоэффициента = "КоэффициентОбъем";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально объему накладной';uk='Розподілена сума %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорційно обсягу накладної'");
	Иначе
		Итог = ИтогоСумма;
		ИмяКоэффициента = "КоэффициентСумма";
		КомментарийРаспределения = НСтр("ru='Распределена сумма %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорционально сумме накладной';uk='Розподілена сума %РаспределенаСумма% (%Валюта%) на %КоличествоСтрок% пропорційно сумі накладної'");
	КонецЕсли;
	
	КомментарийРаспределения = СтрЗаменить(КомментарийРаспределения, "%РаспределенаСумма%", СуммаКРаспределению);
	КомментарийРаспределения = СтрЗаменить(КомментарийРаспределения, "%Валюта%", Валюта);
	КоличествоСтрок = СписокДокументов.Количество();
	Если КоличествоСтрок = 1 Тогда
		 ТекстКоличествоСтрок = "" + КоличествоСтрок + " строку ";
	ИначеЕсли КоличествоСтрок > 1 И КоличествоСтрок < 5 Тогда
		 ТекстКоличествоСтрок = "" + КоличествоСтрок + " строки ";
	Иначе
		 ТекстКоличествоСтрок = "" + КоличествоСтрок + " строк ";
	КонецЕсли;
	КомментарийРаспределения = СтрЗаменить(КомментарийРаспределения, "%КоличествоСтрок%", ТекстКоличествоСтрок);
	
	КРаспределению = СуммаКРаспределению;
	Для Каждого Строка Из СписокДокументов Цикл
		Если Итог * Строка[ИмяКоэффициента] = 0 Тогда
			Списать = 0;
		Иначе
			Списать = Окр(СуммаКРаспределению / Итог * Строка[ИмяКоэффициента], 2, РежимОкругления.Окр15как20);
		КонецЕсли;
		Строка.КомментарийРаспределения = КомментарийРаспределения;
		Если Списать > КРаспределению Тогда
			Строка.Сумма = КРаспределению;
			КРаспределению = 0;
			Прервать;
		Иначе
			Строка.Сумма = Списать;
			КРаспределению = КРаспределению - Списать;
		КонецЕсли;
	КонецЦикла;
	Если КРаспределению <> 0
		И КРаспределению <> СуммаКРаспределению 
	Тогда
		Строка.Сумма = Строка.Сумма + КРаспределению;
	КонецЕсли;
	
	ПересчитатьОстатокКРаспределению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовкиПолей()

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Валюта",
				"Заголовок", Валюта);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаНеРаспределено",
				"Заголовок", Валюта);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументовСумма",
				"Заголовок", НСтр("ru='Сумма';uk='Сума'") +" (" + ВалютаУпр + ")");
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументовВес",
				"Заголовок", НСтр("ru='Вес';uk='Вага'") +" (" + НаименованиеЕдиницыИзмеренияВеса + ")");
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументовОбъем",
				"Заголовок", НСтр("ru='Объем';uk='Об''єм'") +" (" + НаименованиеЕдиницыИзмеренияОбъема + ")");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыДокумента()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Строки.НомерСтроки       КАК НомерСтроки,
	|	Строки.АналитикаРасходов КАК Ссылка,
	|	Строки.Содержание        КАК Содержание,
	|	Строки.Количество        КАК Количество,
	|	Строки.Сумма             КАК Сумма,
	|	Строки.СтавкаНДС         КАК СтавкаНДС,
	|	Строки.Подразделение     КАК Подразделение,
	|	Строки.СтатьяРасходов    КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВтМассивСтрок
	|ИЗ
	|	&МассивСтрок КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.АналитикаРасходов) 
	|		= ТИП(Документ.ПоступлениеТоваровУслуг)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтроки       КАК НомерСтроки,
	|	Строки.Ссылка            КАК Ссылка,
	|	Строки.Содержание        КАК Содержание,
	|	Строки.Количество        КАК Количество,
	|	Строки.Сумма             КАК Сумма,
	|	Строки.СтавкаНДС         КАК СтавкаНДС,
	|	Строки.Подразделение     КАК Подразделение,
	|	Строки.СтатьяРасходов    КАК СтатьяРасходов
	|ПОМЕСТИТЬ МассивСтрок
	|ИЗ
	|	ВтМассивСтрок КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.Ссылка) 
	|		= ТИП(Документ.ПоступлениеТоваровУслуг)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Строки.Сумма) КАК Сумма
	|ИЗ
	|	МассивСтрок КАК Строки
	|;
	|////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Строки.Содержание     КАК Содержание,
	|	Строки.Количество     КАК Количество,
	|	Строки.СтавкаНДС      КАК СтавкаНДС,
	|	Строки.Подразделение  КАК Подразделение,
	|	Строки.СтатьяРасходов КАК СтатьяРасходов
	|ПОМЕСТИТЬ СодержаниеРасходов
	|ИЗ
	|	МассивСтрок КАК Строки
	|ГДЕ
	|	Строки.Содержание <> НЕОПРЕДЕЛЕНО
	|;
	|////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Строки.Содержание     КАК Содержание,
	|	Строки.Количество     КАК Количество,
	|	Строки.СтавкаНДС      КАК СтавкаНДС,
	|	Строки.Подразделение  КАК Подразделение,
	|	Строки.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	СодержаниеРасходов КАК Строки
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтроки КАК НомерСтроки
	|ИЗ ВтМассивСтрок КАК Строки
	|ГДЕ
	|	Строки.Ссылка = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтроки                            КАК НомерСтроки,
	|	Себестоимость.Регистратор                     КАК АналитикаРасходов,
	|	Себестоимость.Организация                     КАК Организация,
	|	Аналитика.Партнер                             КАК Партнер,
	|	Текст.Содержание                              КАК Содержание,
	|	Текст.Количество                              КАК Количество,
	|	Текст.СтавкаНДС                               КАК СтавкаНДС,
	|	Текст.Подразделение                           КАК Подразделение,
	|	Текст.СтатьяРасходов                          КАК СтатьяРасходов,
	|	СУММА(Себестоимость.Количество)               КАК КоэффициентКоличество,
	|	СУММА(Себестоимость.Стоимость)                КАК КоэффициентСумма,
	|	СУММА(Себестоимость.Количество * &ТекстЗапросаВесУпаковки)   	  КАК КоэффициентВес,
	|	СУММА(Себестоимость.Количество * &ТекстЗапросаОбъемУпаковки) 	  КАК КоэффициентОбъем,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаВесУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                        КАК ОшибкаКоэффициентВес,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаОбъемУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                        КАК ОшибкаКоэффициентОбъем
	|ИЗ
	|	МассивСтрок КАК Строки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ПО Строки.Ссылка = Себестоимость.Регистратор
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО Себестоимость.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиНоменклатуры
	|	ПО Себестоимость.АналитикаУчетаНоменклатуры = КлючиНоменклатуры.КлючАналитики
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО КлючиНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ СодержаниеРасходов КАК Текст
	|	ПО ИСТИНА
	|СГРУППИРОВАТЬ ПО
	|	Строки.НомерСтроки,
	|	Себестоимость.Регистратор,
	|	Себестоимость.Период,
	|	Себестоимость.Организация,
	|	Аналитика.Партнер,
	|	Текст.Содержание,
	|	Текст.Количество,
	|	Текст.СтавкаНДС,
	|	Текст.Подразделение,
	|	Текст.СтатьяРасходов
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0 
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СпрНоменклатура.ЕдиницаИзмерения", "СпрНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СпрНоменклатура.ЕдиницаИзмерения", "СпрНоменклатура"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("МассивСтрок", ПолучитьИзВременногоХранилища(Параметры.ТаблицаСтрок));
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	Выборка.Следующий();
	СуммаКРаспределению = Выборка.Сумма;
	
	Выборка = Результат[4].Выбрать();
	Выборка.Следующий();
	
	Содержание = Выборка.Содержание;
	Количество = Выборка.Количество;
	СтавкаНДС = Выборка.СтавкаНДС;
	Подразделение = Выборка.Подразделение;
	СтатьяРасходов = Выборка.СтатьяРасходов;
	
	СтрокиКУдалению.Загрузить(Результат[5].Выгрузить());
	СписокДокументов.Загрузить(Результат[6].Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПравилоРаспределения() 
	ПравилоРаспределенияВСтатье = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходов, "ПравилоРаспределенияНаСебестоимость");
	Если ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноКоличеству
		ИЛИ ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПустаяСсылка()
	Тогда
		ПравилоРаспределения = "ПоКоличеству";
	ИначеЕсли ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноСебестоимости Тогда
		ПравилоРаспределения = "ПоСумме";
	ИначеЕсли ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноВесу Тогда
		ПравилоРаспределения = "ПоВесу";
	ИначеЕсли ПравилоРаспределенияВСтатье = Перечисления.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноОбъему Тогда
		ПравилоРаспределения = "ПоОбъему";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоговыеСуммы()
	ИтогоСумма = СписокДокументов.Итог("КоэффициентСумма");
	ИтогоКоличество = СписокДокументов.Итог("КоэффициентКоличество");
	ИтогоВес = СписокДокументов.Итог("КоэффициентВес");
	ИтогоОбъем = СписокДокументов.Итог("КоэффициентОбъем");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОстатокКРаспределению()
	ОсталосьРаспределить = СуммаКРаспределению - СписокДокументов.Итог("Сумма")
КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатВоВременноеХранилище()
	
	ВыгружаемыеПоля = "
	|НомерСтроки, 
	|Сумма,
	|Содержание,
	|КомментарийРаспределения,
	|Количество,
	|СтавкаНДС,
	|Подразделение,
	|АналитикаРасходов,
	|СтатьяРасходов
	|";
	ПараметрыЗакрытия = Новый Структура("АдресВоВременномХранилище, СтрокиУДалению",
						ПоместитьВоВременноеХранилище(СписокДокументов.Выгрузить(,ВыгружаемыеПоля), АдресВоВременномХранилище),
						ПоместитьВоВременноеХранилище(СтрокиКУдалению.Выгрузить(,"НомерСтроки"), АдресСтрокКУдалению));
	Возврат ПараметрыЗакрытия;

КонецФункции

&НаСервере
Функция ЗаполнитьИнформационныеПоля(Данные)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Аналитика.Партнер                         КАК Партнер,
	|	СУММА(Себестоимость.Количество)           КАК КоэффициентКоличество,
	|	СУММА(Себестоимость.Стоимость)            КАК КоэффициентСумма,
	|	СУММА(Себестоимость.Количество 
	|		* ЕСТЬNULL(&ТекстЗапросаВесУпаковки, 0)
	|	)                                         КАК КоэффициентВес,
	|	СУММА(Себестоимость.Количество 
	|		* ЕСТЬNULL(&ТекстЗапросаОбъемУпаковки, 0)
	|	) КАК КоэффициентОбъем,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаВесУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                    КАК ОшибкаКоэффициентВес,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаОбъемУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                    КАК ОшибкаКоэффициентОбъем
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО Себестоимость.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиНоменклатуры
	|	ПО Себестоимость.АналитикаУчетаНоменклатуры = КлючиНоменклатуры.КлючАналитики
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО КлючиНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Себестоимость.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Регистратор,
	|	Аналитика.Партнер
	|";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаВесУпаковки", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СпрНоменклатура.ЕдиницаИзмерения","СпрНоменклатура"));
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаОбъемУпаковки", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СпрНоменклатура.ЕдиницаИзмерения","СпрНоменклатура"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Ссылка", Данные);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() <> 0 Тогда
		СтрокаРезультата = Новый Структура("Партнер,
		|КоэффициентКоличество,
		|КоэффициентСумма,
		|КоэффициентВес,
		|КоэффициентОбъем,
		|ОшибкаКоэффициентВес,
		|ОшибкаКоэффициентОбъем
		|");
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, Результат[0]);
	Иначе
		СтрокаРезультата = Неопределено;
	КонецЕсли;
	
	Возврат СтрокаРезультата;

КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеКоэффициентов()
	Если СписокДокументов.Количество() = 0 Тогда
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	Если ПравилоРаспределения = "ПоКоличеству" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("КоэффициентКоличество") = 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Ложь;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Ложь;
	ИначеЕсли ПравилоРаспределения = "ПоВесу" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("ОшибкаКоэффициентВес") <> 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Истина;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Ложь;
		Элементы.ПредупреждениеДекорацияТекст.Заголовок = НСтр("ru='В документах поступления есть строки с незаполненным весом. Распределение не будет произведено на данные строки.';uk='У документах надходження є рядки з незаповненою вагою. Розподіл не буде виконано на дані рядка.'");
	ИначеЕсли ПравилоРаспределения = "ПоОбъему" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("ОшибкаКоэффициентОбъем") <> 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Ложь;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Истина;
		Элементы.ПредупреждениеДекорацияТекст.Заголовок = НСтр("ru='В документах поступления есть строки с незаполненным объемом. Распределение не будет произведено на данные строки.';uk='У документах надходження є рядки з незаповненим об''ємом. Розподіл не буде вироблено на дані рядка.'");
	ИначеЕсли ПравилоРаспределения = "ПоСумме" Тогда
		ЕстьОшибки = ?(СписокДокументов.Итог("КоэффициентКоличество") = 0, Истина, Ложь);
		Элементы.СписокДокументовОшибкаКоэффициентВес.Видимость = Ложь;
		Элементы.СписокДокументовОшибкаКоэффициентОбъем.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаПредупреждение.Видимость = ЕстьОшибки;
КонецПроцедуры

#КонецОбласти
